{
  "quotes": {
    "sections": {
      "endorsements-golden-valley": {
        "1": {
          "quotes-image": "dahlman",
          "quotes-image-alt": "Dennis & Valerie Dahlman from Golden Valley",
          "quotes-attribute": "Dennis & Valerie Dahlman, Golden Valley",
          "quotes-testimonial": "We are very confident Blong will be an outstanding Hennepin County Commissioner. We admire his commitment, compassion, inclusiveness and judgment as a political leader. His courage and integrity will serve us well. He listens and then acts. He will be an effective voice for positive change."
        },
        "2": {
          "quotes-image": "pentel",
          "quotes-image-alt": "Paula Pentel from Golden Valley",
          "quotes-attribute": "Paula Pentel, Golden Valley",
          "quotes-testimonial": "Blong understands the possibilities of County Commissioner and through his life experiences, legal training, and listening, he will best represent the diverse residents of District 2."
        },
        "3": {
          "quotes-image": "scanlon",
          "quotes-image-alt": "DeDe and Tom Scanlon from Golden Valley",
          "quotes-attribute": "DeDe and Tom Scanlon, Golden Valley",
          "quotes-testimonial": "Without a doubt, Blong is the most qualified person for Hennepin County Commissioner District 2. As a refugee immigrating to America with his family, he overcame great adversity to become an attorney and the first Hmong-American elected to the Minneapolis City Council. We have known Blong for several years. We trust him to do the right thing. He will not be a candidate who makes promises that he does not keep. His experience, honesty and ability to look at issues from all sides will allow him to study any problems and concerns that affect the communities he represents. He is a listener and a problem solver who will work closely with the communities to find a solution to their concerns."
        },
        "4": {
          "quotes-image": "snope",
          "quotes-image-alt": "Andy Snope, Golden Valley",
          "quotes-attribute": "Andy Snope, Golden Valley",
          "quotes-testimonial": "I support Blong because he has a grounded, thought-out, information gathering, common sense approach to decision making. He is easy to talk to and he listens. I feel like I have an advocate in government with Blong."
        }
      },
      "endorsements-minneapolis": {
        "1": {
          "quotes-image": "hardeman",
          "quotes-image-alt": "Kelley Hardeman from Minneapolis",
          "quotes-attribute": "Kelley Hardeman, Minneapolis",
          "quotes-testimonial": "Blong has my support. He’s the most capable and experienced candidate to bring more enhancements to District 2. He is respectful of this community and has defended the Northside through and through. He answers my calls and follows up on every situation."
        },
        "2": {
          "quotes-image": "gaba",
          "quotes-image-alt": "Mohammad Gaba from Minneapolis",
          "quotes-attribute": "Mohammad Gaba, Minneapolis",
          "quotes-testimonial": "I support Blong because he cares deeply about diversity, inclusion, and equity. As a refugee who grew up here, Blong relates to my struggles and understands my priorities as a Somali American. He is open and available to all."
        },
        "3": {
          "quotes-image": "yang",
          "quotes-image-alt": "John & Pangthao Yang from Minneapolis",
          "quotes-attribute": "John & Pangthao Yang, Minneapolis",
          "quotes-testimonial": "We have noticed a positive change in North Minneapolis during Blong’s time in office. We appreciate his hard work. For the first time, we had someone who could help us navigate the system."
        },
        "4": {
          "quotes-image": "lefleur-marrari",
          "quotes-image-alt": "Giuseppe Marrari & Mike LaFleur from Minneapolis",
          "quotes-attribute": "Giuseppe Marrari & Mike LaFleur, Minneapolis",
          "quotes-testimonial": "Blong’s personal journey from a refugee camp to where he is today has made him empathetic to the needs of the under-represented. He has tirelessly stood up for the little guy and for what’s right, even when others may have been swayed by popular opinion. He has also stood up to extreme cultural pressure in pushing for LGBTQ and women’s rights in the Hmong community. Best of all, Blong is humble about all of this. You’ll never see him boast about all his accomplishments. But we guarantee you, anyone who has personally worked with Blong on an issue won’t stop talking about how good he is as a public servant. We’re excited to see what Blong can do as County Commissioner. We know he will work hard to get things done, improve efficiency, and increase accessibility to County services for all residents."
        },
        "5": {
          "quotes-image": "hoag",
          "quotes-image-alt": "Peter Hoag from Minneapolis",
          "quotes-attribute": "Peter Hoag, Minneapolis",
          "quotes-testimonial": "I believe Blong will fairly represent me even though we grew up with different cultural traditions."
        },
        "6": {
          "quotes-image": "lakosky",
          "quotes-image-alt": "Mark Lakosky from Minneapolis Firefighters, Local 82",
          "quotes-attribute": "Mark Lakosky, President, MFD L82",
          "quotes-testimonial": "I had the privilege to work with Blong on a number of public safety issues concerning the Minneapolis Fire Department. I can say that I have never seen an elected official who was always aware and sensitive to the needs of his constituents and who worked daily to improve their lives and experiences in the City of Minneapolis. Hennepin County would be served well by electing Blong."
        },
        "7": {
          "quotes-image": "stillman",
          "quotes-image-alt": "Sue Watson Stillman, Minneapolis (Bryn Mawr)",
          "quotes-attribute": "Sue Watson Stillman, Minneapolis (Bryn Mawr)",
          "quotes-testimonial": "I met Blong and his wife Mai Neng through the PTA at our children’s school, Bryn Mawr Elementary. I am impressed by the depth of his personal and professional experience, his thoughtfulness, and his commitment to the community. He is not afraid to stand up for what he believes in, even when it is difficult. I strongly support Blong for Hennepin County Commissioner!"
        },
        "8": {
          "quotes-image": "biernat",
          "quotes-image-alt": "Joe Biernat, Northeast Minneapolis",
          "quotes-attribute": "Joe Biernat, Northeast Minneapolis",
          "quotes-testimonial": "Our County District has a special opportunity to elect a candidate who truly understands adversity. From a refugee camp in Thailand to graduating from UCLA and then U of M Law School, Blong Yang has worked hard, always helping others in need. He was elected to the Minneapolis City Council, chaired the City’s Public Safety Committee where he worked on police-community relations, and was a budget hawk – making sure tax payer dollars were used prudently. It is high time the Hennepin County Board has a member representing such rich diversity and unique qualifications."
        },
        "8": {
          "quotes-image": "forney",
          "quotes-image-alt": "Meg Forney, Minneapolis Park and Recreation Board Commissioner-At-Large",
          "quotes-attribute": "Meg Forney, Minneapolis Park and Recreation Board Commissioner-At-Large",
          "quotes-testimonial": "While serving on the Minneapolis Riverfront Partnership, I had an opportunity to work directly with Blong Yang, then City Council Member. I watched him listen and provide thoughtful insights that were grounded in his community’s needs and the perspective of unintended consequences that governance can bring. Blong takes tough votes and advocates for those without a voice in government. He understands the ramifications of poor policies and stands by unpopular, yet, more prudent votes."
        },
        "9": {
          "quotes-image": "shallbetter",
          "quotes-image-alt": "Clarence Shallbetter, Minneapolis (Bryn Mawr)",
          "quotes-attribute": "Clarence Shallbetter, Minneapolis (Bryn Mawr)",
          "quotes-testimonial": "Blong listens well to diverse ideas and opinions. An experienced public leader, he encourages dialogue especially on the county's biggest functions of health and human services. Ever friendly and smiling, he will be a great County Commissioner."
        },
        "10": {
          "quotes-image": "biernat",
          "quotes-image-alt": "Joe Biernat, NE Minneapolis",
          "quotes-attribute": "Joe Biernat, NE Minneapolis",
          "quotes-testimonial": "Our County District has a special opportunity to elect a candidate who truly understands adversity. From a refugee camp in Thailand to graduating from UCLA and then U of M Law School, Blong Yang has worked hard, always helping others in need. He was elected to the Minneapolis City Council, chaired the City’s Public Safety Committee where he worked on police-community relations, and was a budget hawk – making sure tax payer dollars were used prudently. It is high time the Hennepin County Board has a member representing such rich diversity and unique qualifications."
        },
        "11": {
          "quotes-image": "nelson",
          "quotes-image-alt": "Vivian Jenkins Nelson, N Minneapolis",
          "quotes-attribute": "Vivian Jenkins Nelson, N Minneapolis",
          "quotes-testimonial": "Two things I know about Blong. One, he cares about community. Two, you can disagree with him civilly. That’s why I support Blong for Hennepin Count Commissioner."
        }
      },
      "endorsements-plymouth": {
        "1": {
          "quotes-image": "beard",
          "quotes-image-alt": "Marge Beard, Plymouth",
          "quotes-attribute": "Marge Beard, Plymouth",
          "quotes-testimonial": "Blong is right for District 2 and he is right for Plymouth!  He has the hands-on experience to make strong policy decisions and to manage the 2nd largest budget in the state. Blong will be responsive to and represent the entire district."
        },
        "2": {
          "quotes-image": "erickson",
          "quotes-image-alt": "Rolf & Jean Erickson from Plymouth",
          "quotes-attribute": "Rolf & Jean Erickson, Plymouth",
          "quotes-testimonial": "We support Blong for Hennepin County Commissioner District 2 because he is absolutely the best candidate. He is an honorable man and he will hear and represent ALL citizens of the district fairly and equally."
        },
        "3": {
          "quotes-image": "groetken",
          "quotes-image-alt": "Mary & Terry Groetken from Plymouth",
          "quotes-attribute": "Mary & Terry Groetken, Plymouth",
          "quotes-testimonial": "We are supporting Blong because we know him to be an intelligent, thoughtful person who thinks about all sides of the issues before he makes decisions. His decisions are made with common sense behind them — especially anything that has to do with taxpayer money. He truly respects all people and listens."
        },
        "4": {
          "quotes-image": "rosen",
          "quotes-image-alt": "Larry Rosen, Plymouth",
          "quotes-attribute": "Larry Rosen, Plymouth",
          "quotes-testimonial": "I never get involved in politics but I’ve known Blong for a number of years and he’s a good guy. That’s why I support him. He’s a good guy."
        }
      },
      "endorsements-stanthony": {
        "1": {
          "quotes-image": "jerome",
          "quotes-image-alt": "Marcella Jerome, St. Anthony",
          "quotes-attribute": "Marcella Jerome, St. Anthony",
          "quotes-testimonial": "I support Blong because he supports people at every stage of life. I hope he can make changes in transportation for seniors, nutritious food with better access for seniors, and healthcare reform for seniors. So that the larger community knows seniors get the care the public thinks we are getting."
        }
      }
    }
  }
}