{
  "quotes": {
    "sections": {
      "endorsements-minneapolis": {
        "1": {
          "quotes-image": "hardeman",
          "quotes-image-alt": "Kelley Hardeman from Minneapolis",
          "quotes-attribute": "Kelley Hardeman, Minneapolis",
          "quotes-testimonial": "Blong has my support. He’s the most capable and experienced candidate to bring more enhancements to District 2. He is respectful of this community and has defended the Northside through and through. He answers my calls and follows up on every situation."
        },
        "2": {
          "quotes-image": "gaba",
          "quotes-image-alt": "Mohammad Gaba from Minneapolis",
          "quotes-attribute": "Mohammad Gaba, Minneapolis",
          "quotes-testimonial": "I support Blong because he cares deeply about diversity, inclusion, and equity. As a refugee who grew up here, Blong relates to my struggles and understands my priorities as a Somali American. He is open and available to all."
        },
        "3": {
          "quotes-image": "yang",
          "quotes-image-alt": "John & Pangthao Yang from Minneapolis",
          "quotes-attribute": "John & Pangthao Yang, Minneapolis",
          "quotes-testimonial": "We have noticed a positive change in North Minneapolis during Blong’s time in office. We appreciate his hard work. For the first time, we had someone who could help us navigate the system."
        },
        "4": {
          "quotes-image": "lefleur-marrari",
          "quotes-image-alt": "Giuseppe Marrari & Mike LaFleur from Minneapolis",
          "quotes-attribute": "Giuseppe Marrari & Mike LaFleur, Minneapolis",
          "quotes-testimonial": "Blong’s personal journey from a refugee camp to where he is today has made him empathetic to the needs of the under-represented. He has tirelessly stood up for the little guy and for what’s right, even when others may have been swayed by popular opinion. He has also stood up to extreme cultural pressure in pushing for LGBTQ and women’s rights in the Hmong community. Best of all, Blong is humble about all of this. You’ll never see him boast about all his accomplishments. But we guarantee you, anyone who has personally worked with Blong on an issue won’t stop talking about how good he is as a public servant. We’re excited to see what Blong can do as County Commissioner. We know he will work hard to get things done, improve efficiency, and increase accessibility to County services for all residents."
        },
        "5": {
          "quotes-image": "hoag",
          "quotes-image-alt": "Peter Hoag from Minneapolis",
          "quotes-attribute": "Peter Hoag, Minneapolis",
          "quotes-testimonial": "I believe Blong will fairly represent me even though we grew up with different cultural traditions."
        },
        "6": {
          "quotes-image": "lakosky",
          "quotes-image-alt": "Mark Lakosky from Minneapolis Firefighters, Local 82",
          "quotes-attribute": "Mark Lakosky, President, MFD L82",
          "quotes-testimonial": "I had the privilege to work with Blong on a number of public safety issues concerning the Minneapolis Fire Department. I can say that I have never seen an elected official who was always aware and sensitive to the needs of his constituents and who worked daily to improve their lives and experiences in the City of Minneapolis. Hennepin County would be served well by electing Blong."
        },
        "7": {
          "quotes-image": "stillman",
          "quotes-image-alt": "Sue Watson Stillman, Minneapolis (Bryn Mawr)",
          "quotes-attribute": "Sue Watson Stillman, Minneapolis (Bryn Mawr)",
          "quotes-testimonial": "I met Blong and his wife Mai Neng through the PTA at our children’s school, Bryn Mawr Elementary. I am impressed by the depth of his personal and professional experience, his thoughtfulness, and his commitment to the community. He is not afraid to stand up for what he believes in, even when it is difficult. I strongly support Blong for Hennepin County Commissioner!"
        },
        "8": {
          "quotes-image": "biernat",
          "quotes-image-alt": "Joe Biernat, Northeast Minneapolis",
          "quotes-attribute": "Joe Biernat, Northeast Minneapolis",
          "quotes-testimonial": "Our County District has a special opportunity to elect a candidate who truly understands adversity. From a refugee camp in Thailand to graduating from UCLA and then U of M Law School, Blong Yang has worked hard, always helping others in need. He was elected to the Minneapolis City Council, chaired the City’s Public Safety Committee where he worked on police-community relations, and was a budget hawk – making sure tax payer dollars were used prudently. It is high time the Hennepin County Board has a member representing such rich diversity and unique qualifications."
        },
        "8": {
          "quotes-image": "forney",
          "quotes-image-alt": "Meg Forney, Minneapolis Park and Recreation Board Commissioner-At-Large",
          "quotes-attribute": "Meg Forney, Minneapolis Park and Recreation Board Commissioner-At-Large",
          "quotes-testimonial": "While serving on the Minneapolis Riverfront Partnership, I had an opportunity to work directly with Blong Yang, then City Council Member. I watched him listen and provide thoughtful insights that were grounded in his community’s needs and the perspective of unintended consequences that governance can bring. Blong takes tough votes and advocates for those without a voice in government. He understands the ramifications of poor policies and stands by unpopular, yet, more prudent votes."
        },
        "9": {
          "quotes-image": "shallbetter",
          "quotes-image-alt": "Clarence Shallbetter, Minneapolis (Bryn Mawr)",
          "quotes-attribute": "Clarence Shallbetter, Minneapolis (Bryn Mawr)",
          "quotes-testimonial": "Blong listens well to diverse ideas and opinions. An experienced public leader, he encourages dialogue especially on the county's biggest functions of health and human services. Ever friendly and smiling, he will be a great County Commissioner."
        },
        "10": {
          "quotes-image": "biernat",
          "quotes-image-alt": "Joe Biernat, NE Minneapolis",
          "quotes-attribute": "Joe Biernat, NE Minneapolis",
          "quotes-testimonial": "Our County District has a special opportunity to elect a candidate who truly understands adversity. From a refugee camp in Thailand to graduating from UCLA and then U of M Law School, Blong Yang has worked hard, always helping others in need. He was elected to the Minneapolis City Council, chaired the City’s Public Safety Committee where he worked on police-community relations, and was a budget hawk – making sure tax payer dollars were used prudently. It is high time the Hennepin County Board has a member representing such rich diversity and unique qualifications."
        },
        "11": {
          "quotes-image": "nelson",
          "quotes-image-alt": "Vivian Jenkins Nelson, N Minneapolis",
          "quotes-attribute": "Vivian Jenkins Nelson, N Minneapolis",
          "quotes-testimonial": "Two things I know about Blong. One, he cares about community. Two, you can disagree with him civilly. That’s why I support Blong for Hennepin County Commissioner."
        },
        "12": {
          "quotes-image": "shaheen",
          "quotes-image-alt": "Lynda Shaheen, Minneapolis (Bryn Mawr)",
          "quotes-attribute": "Lynda Shaheen, Minneapolis (Bryn Mawr)",
          "quotes-testimonial": "I have volunteered side-by-side with Blong for many years at Bryn Mawr Elementary School. I have been impressed by his dedication to the community and his family’s commitment to Minneapolis’ Northside. He has years of valuable experience serving on the Minneapolis City Council and his own personal experiences as a child with the Health and Human Services system. I have seen him jump right in and work with all members of a community to work towards a better future. I strongly support Blong Yang for Hennepin County Commissioner!"
        },
        "13": {
          "quotes-image": "ostrow",
          "quotes-image-alt": "Paul T. Ostrow, NE Minneapolis",
          "quotes-attribute": "Paul T. Ostrow, NE Minneapolis",
          "quotes-testimonial": "Blong is smart and he is thoughtful. I frequently witnessed Blong asking the tough questions and taking the right stands at Minneapolis City Hall even when going along with everyone else would have been much easier. Now more than ever, we need elected officials who will stand up for principle and stand up for their constituents. Blong understands that it is not about him – it is about those he will serve. He has the empathy and understanding to make sure the poorest and most vulnerable among us will be served by a compassionate Hennepin County. He has the experience, commitment and integrity to be an outstanding voice of the people on the Hennepin County Board. Join me in voting for Blong Yang on November 6th."
        },
        "14": {
          "quotes-image": "johnson",
          "quotes-image-alt": "Barbara Johnson, Minneapolis",
          "quotes-attribute": "Barbara Johnson, Minneapolis",
          "quotes-testimonial": "I worked with Blong on the Minneapolis City Council for four years. I found him to be a thoughtful and honest person to work with, no pretenses. He saved hundreds of houses from demolition. He worked to make sure quality housing was built on vacant lots and residents were encouraged and helped to purchase their first homes. He chaired the Public Safety Committee. He was even-handed and thoughtful in his approach to policing in our community. He worked to get funding for body cameras for all police officers. I’ll be voting for Blong Yang for Hennepin County Commissioner because he has the best interest of the people in the district in mind. His thoughtful approach to government will give him great success on the county board."
        }
      }
    }
  }
}