{
  "news-events": {
    "videos": {
      "video-list": {
        "1": {
          "video-title": "Local Vote 2018: Hennepin County Commissioner, District 2",
          "video-id" : "6OQWcX2kC2k",
          "video-duration": "T01M48S",
          "video-upload-date": "2018-10-17",
          "video-desc": "Today in Local Vote 2018, we have statements from two candidates wanting to represent District 2 on the Hennepin County Board of Commissioners. District 2 covers northeast Minneapolis, Golden Valley, Medicine Lake and Plymouth. The candidates are Irene Fernando and Blong Yang. "
        },
        "2": {
          "video-title": "Blong Yang for Hennepin County Commissioner",
          "video-id": "NKbTxVOuDuI",
          "video-duration": "T02M10S",
          "video-upload-date": "2018-10-21",
          "video-desc": "Blong Yang, a former recipient of county services, is running to lead that same system. More specifically, he is running to be the next Hennepin County Commissioner in District 2. His experience includes interning with Hennepin County in the Child Protection Services; working for Legal Aid Society of Minneapolis where he advocated for clients on the issues of language access and social services; running his own solo law practice for ten years; represented clients from being civilly committed through the Hennepin County Bar Association's Commitment Defense Panel; working for the City of Minneapolis as a civil rights investigator; and being on the Minneapolis City Council for four years (2014-2017). While on the Council, he chaired the Public Safety, Civil Rights, and Emergency Management Committee. He worked hard to increase the number of police, fire, and 911 staff, thus decreasing the response time. He secured funding for body cameras and implicit bias training. He spearheaded the Infill Housing Program to build new homes on 300 city-owned empty lots with $1.5 million for a pilot first year. He resurrected $1 Housing (Vacant Housing Recycling) Program which saved almost 100 houses from demolition and converted them into new rehabbed homes, putting them back on the tax rolls. Lastly, he brought in over $100 million in development to the Ward he represented; helped to create over 300 jobs, some of which went to Northsiders; and assisted the start-up of three brewery small businesses. His experiences on the City Council will be fully transferable to the Hennepin County Board. He is endorsed by the Minneapolis Fire Fighters Local 82 and the Hennepin County Sheriff's Deputies Association. Vote for Blong Yang for Hennepin County Commissioner on November 6, 2018."
        },
        "3": {
          "video-title": "Learn about Blong’s work on mental health by watching the NAMI Public Forum on Mental Health",
          "video-id": "ykII5gD48ZA",
          "video-duration": "T01H20M33S",
          "video-upload-date": "2018-10-01",
          "video-desc": "NAMI-Hennepin County District 2 - Hennepin County Commissioners Debate"
        },
        "4": {
          "video-title": "Blong Yang on this week's episode of Motivation with Ron Henderson",
          "video-id": "gYj8ilIMXoc",
          "video-duration": "T28M13S",
          "video-upload-date": "2018-09-13",
          "video-desc": "This episode of motivation Motivational speaker Ron Henderson aka \"The Fitness King\" get's up close and personal with Blong Yang, who is running for Hennepin county commissioner in district 2."
        },
        "5": {
          "video-title": "Our campaign video: Blong Yang for HC Commissioner",
          "video-id": "HZ3F3z8E0hM",
          "video-duration": "T0M59S",
          "video-upload-date": "2018-07-20",
          "video-desc": "Blong Yang, North Minneapolis resident, is running for Hennepin County Commissioner in District 2. Blong explains what a county commissioner does."
        },
        "6": {
          "video-title": "Hennepin County Comissioner District 2 primary candidates forum",
          "video-id": "P-ACTYIMjAI",
          "video-duration": "T1H21M01S",
          "video-upload-date": "2018-07-31",
          "video-desc": "Recorded July 30, 2018 at Golden Valley City Hall. Sponsored by the Golden Valley League of Women Voters."
        }
      }
    }
  }
}